# Checker Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Checker Class
Members See Also
---
A static class that provides access to the property names that appear in the Checker visual asset schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static class Checker
```

Visual Basic
---
```text
Public NotInheritable Class Checker
```

Visual C++
---
```text
public ref class Checker abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..Checker
# See Also
Checker Members
Autodesk.Revit.DB.Visual Namespace